{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": " add_job_role",
    "1": " assign_project",
    "2": " change_department",
    "3": " check_leave",
    "4": " check_payroll",
    "5": " create_project",
    "6": " generate_report",
    "7": " get_team_lead",
    "8": " list_employees",
    "9": " mark_attendance",
    "10": " onboard_employee",
    "11": " remove_employee",
    "12": " schedule_meeting",
    "13": " update_salary"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    " add_job_role": 0,
    " assign_project": 1,
    " change_department": 2,
    " check_leave": 3,
    " check_payroll": 4,
    " create_project": 5,
    " generate_report": 6,
    " get_team_lead": 7,
    " list_employees": 8,
    " mark_attendance": 9,
    " onboard_employee": 10,
    " remove_employee": 11,
    " schedule_meeting": 12,
    " update_salary": 13
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
